/*

Task 1

Чи буде показано alert? - Так
if ("0") {
  alert( 'Привіт' );
}

*/
/*

Task 2

Використовуючи конструкцію if..else, напишіть код, що запитує: ‘Яка “офіційна” назва JavaScript?’
Якщо відвідувач вводить “ECMAScript”, виведіть “Правильно!”, в іншому випадку — виведіть: “Ви не знаєте? ECMAScript!”

let text = prompt("Яка “офіційна” назва JavaScript?: ");

if(text === "ECMAScript"){
    alert("Правильно!");
}
else{
    alert("Ви не знаєте? ECMAScript!");
}

*/
/*

Task 3

Використовуючи if..else, напишіть код, що отримує число за допомогою prompt і потім виводить повідомлення alert:
1, якщо значення більше нуля,
-1, якщо меньше нуля,
0, якщо дорівнює нулю.

let number = prompt("Введіть число: ");
if(number > 0){
    alert(1);
}
else if(number < 0){
    alert(-1);
}
else{
    alert(0);
}

*/
/*

Task 4

Перепишіть конструкцію if, використовуючи умовний оператор '?':

let result;

if (a + b < 4) {
  result = 'Нижче';
} else {
  result = 'Вище';
}

let result = (a + b < 4) ? 'Нижче' : 'Вище';

*/
/*

Task 5

Перепишіть if..else, використовуючи декілька тернарних операторів '?'.
Для зручності читання рекомендується розділити код на кілька рядків.

let message;

if (login == 'Працівник') {
  message = 'Привіт';
} else if (login == 'Директор') {
  message = 'Вітаю';
} else if (login == '') {
  message = 'Немає логіну';
} else {
  message = '';
}

let message = (login == 'Працівник') ? 'Привіт' :
              (login == 'Директор') ? 'Вітаю' :
              (login == '') ? 'Немає логіну' :
              '';

*/