import React from 'react'
import Vik123 from './Vik123'

export default function Home() {
  return (
    <div className="Home" >

<Vik123/>
        <div className = "container">
        
            <div className = "hometext" id ="#home">Про нас</div>
            <div className="sectionesag">   </div>
              <div> 
                  <div class = "centrtext">Ми - салон штор в місті Мукачево
                Я, Вікторія Завідфолуші його власник і по сумісцицтву продавець, дизайнер, консультант.
                
                 Як то кажуть: «Ніхто краще тебе не буде робити твій бізнес».
                
                 В моїй команді є багато швачок, які в найкоротші терміни шиють ваші роботи.
                
                Є помічники, які любо вам ті замовлення вішають разом з карнизами чи ролетами.
                
                А ще є смм менеджер-моя донька, яка ці самі штори вам фотографує, щоб ви бачили вже готовий результат на сторінці.
                
                Ось так за одним гарним фото стоїть ціла команда людей, які щодня дарують вашим домівкам затишок та комфорт.
                
                Намагатимусь частіше показувати закулісся проєктів і ділитись подробицями)</div>
                  </div>
              </div>

        </div>
  )
}
