// №1 - Чи буде показано alert?
if ("0") {
    alert('Привіт')
} 
// ТАК

// №2 - Використовуючи конструкцію if..else, напишіть код, що запитує: ‘Яка “офіційна” назва JavaScript?’
//Якщо відвідувач вводить “ECMAScript”, виведіть “Правильно!”, в іншому випадку — виведіть: 
//“Ви не знаєте? ECMAScript!”

let ans = prompt('Яка “офіційна” назва JavaScript?')
if (text === 'ECMAScript') {
    alert('Правильно!');
} else {
    alert('Ви не знаєте? ECMAScript!');
}

// №3 - Використовуючи if..else, напишіть код, що отримує число за допомогою prompt і потім 
//виводить повідомлення alert: 1, якщо значення більше нуля, -1, якщо меньше нуля, 0, якщо дорівнює нулю.

let number = prompt('Enter a number: ')
if (number > 0) {
    alert('1')
} else if (number < 0) {
    alert('-1')
} else {
    alert('0')
}

// №4 - Перепишіть конструкцію if, використовуючи умовний оператор '?':

let result = a + b < 4 ? 'Нижче' : 'Вище'

// №5 - Перепишіть if..else, використовуючи декілька тернарних операторів '?'.

let message = (login === 'Працівник') ? 'Привіт' : (login === 'Директор') ? 'Вітаю' : (login === '') ? 
'Немає логіну' : ''

